# UsedInSizing Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConduitSize..::..UsedInSizing Property
ConduitSize Class See Also
---
Whether is used in sizing.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public bool UsedInSizing { get; }
```

Visual Basic
---
```text
Public ReadOnly Property UsedInSizing As Boolean
	Get
```

Visual C++
---
```text
public:
property bool UsedInSizing {
	bool get ();
}
```

# See Also
ConduitSize Class
Autodesk.Revit.DB.Electrical Namespace